app/controllers/line_items_controller.rb

  def create
		@cart = current_cart
		product = Product.find(params[:product_id])
		@line_item = @cart.line_items.build(product: product)


    respond_to do |format|
      if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "6"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Mon, 14 May 2012 09:23:06 UTC +00:00], ["updated_at", Mon, 14 May 2012 09:23:06 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "updated_at") VALUES (?, ?, ?, ?)  [["cart_id", 1], ["created_at", Mon, 14 May 2012 09:23:08 UTC +00:00], ["product_id", 6], ["updated_at", Mon, 14 May 2012 09:23:08 UTC +00:00]]